{
  "toggles":{
    "self":"Toggled on-off using `{prefix}toggle [setting]`",
    "saveLocalCopy":"(Causes each image to be saved to the server storage)",
    "deleteScreens":"(Deletes the image from the channel after processing it)",
    "welcomeMsg":"(Sends a welcome message tagging new members explaining the screenshot system)",
		"blacklistOneOff":"(Whether to blacklist off-by-one screenshots e.g. level 29. Turning this off allows them to repost immediately)",
		"tagModOneOff":"(Whether to tag modRole in logs when a off-by-one screenshot is posted, e.g. level 29)",
    "screenshotScanning":"(Whether to be aware of the screenshotChannel and scan images in that channel )",
		"dmScanning":"(Whether to scan images in DMs or not)",
		"dmMail":"(Whether to forward DMs to mailCategory or not)",
		"attachmentURLs":"(Whether to add `Attachment #1: <URL>` to the mail embed when sending images)",
    "testMode":"(Provides more information about what is scanned and whatnot)",
		"performanceMode":"(Provides more information (in the console) about exectution time and whatnot)",
    "debugMode":"(Whether to log the discord.js debug information. INCLUDING TOKEN! Don't post logs if this is on.)",
    "processInfoMode":"(Whether to log the Node JS process information)",
    "dmAutoReply":"(Whether mail tickets will bypass needing a `=r ` or `=reply ` at the start of the message to successfully send.)",
		"respondVerify":"(Whether to send a message every time someone successfully verifies through pokenav)"
  },
  "numbers":{
    "self":"Changed using `{prefix}set [setting] [value]`. Must be a number",
    "threshold":"(The color level at which all values above will be white and all below with be black. Different for different servers for some reason.)",
    "msgDeleteTime":"(How long (in seconds) error/help messages stick around before self destructing. Set to 0 to disable.)",
    "blacklistTime":"(How long (in days) to prevent someone from posting a screenshot after being scanned at under 30.)",
		"targetLevel":"(The level for the gate role.)"
  },
  "chars":{
    "self":"Changed using `{prefix}set [setting] [value]`. Must be a string of characters",
    "prefix":"(Bot prefix for server commands)",
    "prefix2":"(Another prefix)"
  },
  "ids":{
    "self":"Changed using `{prefix}set [setting] [value]`. Must be a discord id",
    "screenshotChannel":"(The channel to scan for screenshots)",
    "logsChannel":"(The channel where the logs are posted. Leave blank for no logs)",
    "profileChannel":"(The channel where the user is tagged afterwards. Leave blank for no tag)",
    "targetLevelRole":"(The role for successful scans at targetLevel. e.g. level 30+)",
    "level40Role":"(The role for level 40+ screenshots)",
    "level50Role":"(The role for level 50+ screenshots)",
    "modRole":"(The mod role intended to be notified when an issue occurs)",
    "serverID":"(The server that the bot is intended to be used in)",
    "blacklistRole":"(The role used to force the bot to ignore certain members. Leave blank to stop the bot from checking)",
		"verifiedRole":"(The Verfied Host role, if you want ]r to remove it)",
    "mailCategory":"(The category to create mail channels)",
    "mailLogChannel":"(The log channel for the mail section of the bot)"
  }
}
